app/models/higienizacion/WebservicePadrao.xml

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-b02-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-b02-. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://core.integracao.mv.com.br" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://core.integracao.mv.com.br" name="WebservicePadrao">
<types>
<xsd:schema>
<xsd:import namespace="http://core.integracao.mv.com.br" schemaLocation="http://172.16.253.11:8184/jintegra-core/services/WebservicePadrao?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="processar">
<part name="xml" element="tns:xml"></part>
</message>
<message name="processarResponse">
<part name="ProcessarRetorno" element="tns:ProcessarRetorno"></part>
</message>
<message name="mensagem">
<part name="mensagem" element="tns:mensagem"></part>
</message>
<message name="mensagemResponse">
<part name="MensagemRetorno" element="tns:MensagemRetorno"></part>
</message>
<portType name="WebservicePadrao">
<operation name="processar">
<input message="tns:processar"></input>
<output message="tns:processarResponse"></output>
</operation>
<operation name="mensagem">
<input message="tns:mensagem"></input>
<output message="tns:mensagemResponse"></output>
</operation>
</portType>
<binding name="WebservicePadraoPortBinding" type="tns:WebservicePadrao">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="processar">
<soap:operation soapAction="http://core.integracao.mv.com.br/processar"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
<operation name="mensagem">
<soap:operation soapAction="http://core.integracao.mv.com.br/mensagem"></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="WebservicePadrao">
<port name="WebservicePadraoPort" binding="tns:WebservicePadraoPortBinding">
<soap:address location="http://172.16.253.11:8184/jintegra-core/services/WebservicePadrao"></soap:address>
</port>
</service>
</definitions>